In [1]:

import pandas as pd

data = pd.DataFrame({"character": ["Goku","Vegeta", "Nappa","Goku","Piccolo"], 
                   "power level": [12000, 16000, 4000, 12000, 3000]})

data

  character  power level
0      Goku        12000
1    Vegeta        16000
2     Nappa         4000
3      Goku        12000
4   Piccolo         3000

## Use df.drop_duplicates() to remove duplicate rows

In [2]:
#Ths create a new dataframe, one can use the inplace() to change the original data
data = data.drop_duplicates()

data

  character  power level
0      Goku        12000
1    Vegeta        16000
2     Nappa         4000
4   Piccolo         3000